Revit 2026 API

# GradientGradientNoiseSize Property

---

The property labeled "Size" from the "Gradient" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GradientNoiseSize { get; }
```
```vb
Public Shared ReadOnly Property GradientNoiseSize As String
	Get
```
```cpp
public:
static property String^ GradientNoiseSize {
	String^ get ();
}
```
```fsharp
static member GradientNoiseSize : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 1000000000".

#### Reference

Gradient Class

Autodesk.Revit.DB.Visual Namespace